src/lambdas/rest/transactions/reverse/checkout-test/_mockChargeResult1.json

{
  "id": "ch_1DLyvaCM9MOvFvZKXzIviRn3",
  "object": "charge",
  "amount": 50,
  "amount_refunded": 0,
  "application": "ca_Bg3hpStH7AImYbs5sSfGH06jTMS0Krwl",
  "application_fee": null,
  "balance_transaction": "txn_1DLyvbCM9MOvFvZKspQ2vEnQ",
  "captured": true,
  "created": 1539720846,
  "currency": "usd",
  "customer": null,
  "description": null,
  "destination": null,
  "dispute": null,
  "failure_code": null,
  "failure_message": null,
  "fraud_details": {},
  "invoice": null,
  "livemode": false,
  "metadata": {
    "lightrailTransactionId": "d8d6ca4f-1f84-4864-8",
    "lightrailTransactionSources": "[{\"rail\":\"internal\",\"internalId\":\"id\"},{\"rail\":\"lightrail\",\"valueId\":\"ccda5d3c-c377-45e1-a\"},{\"rail\":\"stripe\",\"source\":\"tok_visa\"}]",
    "lightrailUserId": "default-test-user-TEST"
  },
  "on_behalf_of": null,
  "order": null,
  "outcome": {
    "network_status": "approved_by_network",
    "reason": null,
    "risk_level": "normal",
    "risk_score": 39,
    "seller_message": "Payment complete.",
    "type": "authorized"
  },
  "paid": true,
  "payment_intent": null,
  "receipt_email": null,
  "receipt_number": null,
  "refunded": false,
  "refunds": {
    "object": "list",
    "data": [],
    "has_more": false,
    "total_count": 0,
    "url": "/v1/charges/ch_1DLyvaCM9MOvFvZKXzIviRn3/refunds"
  },
  "review": null,
  "shipping": null,
  "source": {
    "id": "card_1DLyvaCM9MOvFvZKGh804Dy0",
    "object": "card",
    "address_city": null,
    "address_country": null,
    "address_line1": null,
    "address_line1_check": null,
    "address_line2": null,
    "address_state": null,
    "address_zip": null,
    "address_zip_check": null,
    "brand": "Visa",
    "country": "US",
    "customer": null,
    "cvc_check": null,
    "dynamic_last4": null,
    "exp_month": 10,
    "exp_year": 2019,
    "fingerprint": "MJvnjqDtkyMS9aLA",
    "funding": "credit",
    "last4": "4242",
    "metadata": {},
    "name": null,
    "tokenization_method": null
  },
  "source_transfer": null,
  "statement_descriptor": null,
  "status": "succeeded",
  "transfer_group": null
}