src/lambdas/rest/transactions/reverse/checkout-test/_mockRefundResult2.json

{
  "id": "re_1DLyveCM9MOvFvZKF68ubkJz",
  "object": "refund",
  "amount": 99,
  "balance_transaction": "txn_1DLyveCM9MOvFvZK0YOerZBF",
  "charge": "ch_1DLyvbCM9MOvFvZKAdFVcCtd",
  "created": 1539720850,
  "currency": "usd",
  "metadata": {
    "reason": "not specified"
  },
  "reason": null,
  "receipt_number": null,
  "source_transfer_reversal": null,
  "status": "succeeded"
}